In [ ]:
Q1. List any five functions of the pandas library with execution.

In [56]:
import pandas as pd
df=pd.read_csv("customers.csv")
df.describe()

            Index
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [42]:
df.iloc[0:4, [0,3,5]]

   Index Last Name               City
0      1    Baxter       East Leonard
1      2    Lozano  East Jimmychester
2      3     Berry      Isabelborough
3      4     Olsen         Bensonview

In [44]:
df.loc[0:4, ['Index','Last Name','City']]

   Index Last Name               City
0      1    Baxter       East Leonard
1      2    Lozano  East Jimmychester
2      3     Berry      Isabelborough
3      4     Olsen         Bensonview
4      5    Bender     West Priscilla

In [45]:
pd.unique(df['Subscription Date'])

array(['2020-08-24', '2021-04-23', '2020-03-25', '2020-06-02',
       '2021-04-17', '2020-02-25', '2021-08-24', '2021-04-12',
       '2020-01-13', '2021-11-08', '2021-10-20', '2020-11-29',
       '2021-12-02', '2021-02-08', '2022-01-26', '2022-04-12',
       '2021-03-10', '2022-03-26', '2020-09-24', '2021-09-24',
       '2022-01-12', '2020-09-15', '2020-08-19', '2020-09-08',
       '2021-04-06', '2022-05-24', '2022-02-20', '2022-05-26',
       '2020-07-30', '2020-04-26', '2021-09-15', '2022-01-13',
       '2021-04-24', '2021-09-21', '2021-11-03', '2022-01-04',
       '2021-08-10', '2021-02-24', '2021-10-22', '2021-11-01',
       '2020-10-10', '2021-09-08', '2020-12-13', '2022-05-15',
       '2021-12-06', '2020-07-01', '2020-04-23', '2022-03-11',
       '2022-03-10', '2021-03-19', '2021-03-27', '2021-03-08',
       '2020-10-15', '2020-05-25', '2021-01-25', '2021-03-17',
       '2020-11-15', '2020-12-20', '2020-08-21', '2020-12-10',
       '2022-03-24', '2021-01-02', '2020-01-20', '2020-08-18',
       '2021-01-31', '2020-02-03', '2021-02-20', '2020-02-23',
       '2020-08-22', '2020-02-09', '2022-01-15', '2020-07-11',
       '2021-07-24', '2020-10-21', '2020-06-08', '2020-09-19',
       '2021-11-13', '2021-09-12', '2020-12-28', '2021-11-15',
       '2020-02-18', '2022-05-13', '2020-07-21', '2020-11-10',
       '2021-04-15', '2021-01-09', '2020-03-26', '2021-07-06',
       '2021-06-29', '2021-04-04', '2022-02-17', '2022-01-30',
       '2021-07-10', '2021-09-18', '2021-08-11', '2020-03-11'],
      dtype=object)

In [47]:
df[pd.Categorical(['Subscription Date'])]

   Subscription Date
0         2020-08-24
1         2021-04-23
2         2020-03-25
3         2020-06-02
4         2021-04-17
..               ...
95        2022-01-30
96        2021-07-10
97        2021-09-18
98        2021-08-11
99        2020-03-11

[100 rows x 1 columns]

In [48]:
df.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/

In [49]:
df.tail()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [ ]:
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [15]:

import pandas as pd
data={"A":[22,33,44,55],"B":[22,33,44,55],"C":[22,33,44,55]}
df=pd.DataFrame(data)
def func(df):
    return range(1,len(df)*2+1,2)
new_df = df.reindex(func(df))

print(new_df)
df.reindex(func(new_df))

      A     B     C
1  33.0  33.0  33.0
3  55.0  55.0  55.0
5   NaN   NaN   NaN
7   NaN   NaN   NaN

      A     B     C
1  33.0  33.0  33.0
3  55.0  55.0  55.0
5   NaN   NaN   NaN
7   NaN   NaN   NaN

In [ ]:
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [127]:
data= {'Name': ["Shaheem","Ajay","Soni","Sumit","Nihar","Jay"], 'Value':[10,20,30,40,50,60]}
df=pd.DataFrame(data)
fd=df['Value'][0:3]
fd.sum()

60

In [ ]:
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [128]:
df["Text"]=["ASD","QWER","ZMXAK","ASKASJ","ASASm","ASASJ"]
df["Word_Count"]=df["Text"].apply(len)
df

      Name  Value    Text  Word_Count
0  Shaheem     10     ASD           3
1     Ajay     20    QWER           4
2     Soni     30   ZMXAK           5
3    Sumit     40  ASKASJ           6
4    Nihar     50   ASASm           5
5      Jay     60   ASASJ           5

In [ ]:
Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
Size Count the number of elements in the dataframe
It multiply the rows and columns
print(df.size)
While
Shape returns the Dataframe's Rows and Columns
It returns in the form of Tuple 
For Exanple:

In [29]:
print(df.size)
print(df.shape)

24
(6, 4)

In [ ]:
Q6. Which function of pandas do we use to read an excel file?
pd.read_excel("File_Name")

In [ ]:
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [129]:
df["Email"]=df["Name"]+"@gmail.com"
def username(df):
    df["Username"]=df["Email"].str.split('@').str[0]
    return df

df=username(df)
print(df)

      Name  Value    Text  Word_Count              Email Username
0  Shaheem     10     ASD           3  Shaheem@gmail.com  Shaheem
1     Ajay     20    QWER           4     Ajay@gmail.com     Ajay
2     Soni     30   ZMXAK           5     Soni@gmail.com     Soni
3    Sumit     40  ASKASJ           6    Sumit@gmail.com    Sumit
4    Nihar     50   ASASm           5    Nihar@gmail.com    Nihar
5      Jay     60   ASASJ           5      Jay@gmail.com      Jay

In [ ]:
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [126]:
data={"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]}
df=pd.DataFrame(data)

def func2(df):
    df2= df[(df["A"] > 5) & (df["B"] < 10)]
    return df2

df3=func2(df)
df3

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [ ]:
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [141]:
df["Values"]=df["Word_Count"]+100
print(df)
df["Values"].mean()

      Name  Value    Text  Word_Count              Email Username  Values
0  Shaheem     10     ASD           3  Shaheem@gmail.com  Shaheem     103
1     Ajay     20    QWER           4     Ajay@gmail.com     Ajay     104
2     Soni     30   ZMXAK           5     Soni@gmail.com     Soni     105
3    Sumit     40  ASKASJ           6    Sumit@gmail.com    Sumit     106
4    Nihar     50   ASASm           5    Nihar@gmail.com    Nihar     105
5      Jay     60   ASASJ           5      Jay@gmail.com      Jay     105

104.66666666666667

In [137]:
df["Values"].median()

105.0

In [139]:
df["Values"].std()

1.0327955589886446

In [ ]:
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [15]:
Data = {"Sales": [100,120,50,200,302,401,455,545,345,543], "Date": pd.to_datetime([10-1-2024,11-1-2024,12-1-2024,11-2-2024,25-3-2024,11-5-2024,12-5-2024,13-6-2024,14-7-2024,12-9-2024])}
df=pd.DataFrame(Data)
def rolling(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7).mean()
    return df
df=rolling(df)
df

   Sales                          Date  MovingAverage
0    100 1969-12-31 23:59:59.999997985            NaN
1    120 1969-12-31 23:59:59.999997986            NaN
2     50 1969-12-31 23:59:59.999997987            NaN
3    200 1969-12-31 23:59:59.999997985            NaN
4    302 1969-12-31 23:59:59.999997998            NaN
5    401 1969-12-31 23:59:59.999997982            NaN
6    455 1969-12-31 23:59:59.999997983     232.571429
7    545 1969-12-31 23:59:59.999997983     296.142857
8    345 1969-12-31 23:59:59.999997983     328.285714
9    543 1969-12-31 23:59:59.999997979     398.714286

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [6]:
data = {'Date': pd.to_datetime(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05'])}
df = pd.DataFrame(data)

def add_weekday(df):
  # Add 'Weekday' column with day names (Monday=0, Sunday=6)
    df['Weekday'] = df['Date'].dt.day_name()
    return df

df = add_weekday(df)
print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [ ]:
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [28]:
data = {'Date': pd.to_datetime(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05','2023-01-06', 
                                '2023-02-01', '2023-02-02','2023-02-03','2023-02-04','2023-02-05'])}
df = pd.DataFrame(data)


def func(df):
    return df[(df["Date"]>='2023-01-01') & (df["Date"]<='2023-01-31')]
func(df)

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
5 2023-01-06

In [ ]:
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

To use the basi functions of pandas we need a library called pandas. In order to use it we need to import it.
To import it simply use:
    import pandas as "Any Shortcut"
For Example:
    import pandas as pd